#include <iostream>
#include <iomanip>
#include <string>
#include <cmath>
#include <algorithm>
using namespace std;
int main()
{
    double x, y;
    cin >> x >> y;
    double res = (1 - (x / 100));
    double ans = (y / res);
    cout << ans;
    return 0;
}
/*
!
!
!
!
!
!
!
!بما ان بلاقي بوستات كتير هنا بتسئل علي Mentor فانا هقولك ازاي يبقي عندك اجدعها Mentor في البيت و هتدعيلي 😉🧡
الطريقة دي انا جربتها و فعلا نفعاني بشكل كبير جدا وخليتني احسن بكتير فركز معايا😃
انا اول حاجة عملتها اني جمعت حوالي 150 divs ايوه زي ما بقولك كده و حطيتهم في folder واحد و كل folder من دول جواه اتنين Links (الكونتست نفسها - فديو الشرح)
هتقولي طيب ايه الجديد ما انا بخش ادور علي النت علي اي div بحلها!!
الفرق يباشا ان انت هتنقي الdivs الي بيحلها باب المجال زي errichto و Golin و غيرهم فانت هتفتح كل قناة من دي تفتح كل الdivs الي حلها و تععملها زي ما قولتلك تعمل لكل واحد folder تحط فيه link الفديو و ال link ال div.
المميز في الطريقة دي انها اولا بتخليك تشوف الناس ال legendary بيفكروا ازاي و بجد هتنبهر بطريقة تفكيرهم تاني حاجة انها بتشجعك تحل لانك عارف انك هتقوم تفتح ال div الي عليها الدور و تعملها virtual و بعد ما تخلص ال virtual خالص و تجيب اخرك تشوف بقي الاجابات فكروا فيها ازاي و حلوها ازاي فمفهاش لغبطة خالص 😉
الطريقة دي لما بدئتها خليتني احل حوالي  230 مسئلة في شهر واحد تقريبا نفس عدد المسائل الي كنت حليته في ال 5 شهور الي قبلهم و كمان لا باخد استفادة اكبر من المسئلة فانا بصراحة شايفه طريقة عظيمة لاي حد يجربها 🧡
"ممكن تبدء Div3 كله بعدها تخش علي Div2"
ودي لنك القنوات ورئي تمشي عليهم بنفس الترتيب ده:
1. Colin
https://www.youtube.com/@ColinGalen/videos
2. second thread
https://www.youtube.com/@SecondThread/videos
3. errichto
https://www.youtube.com/@Errichto
4. Neal
https://www.youtube.com/@NealWuProgramming/videos
"⭐⭐⭐⭐مممهمم⭐⭐⭐⭐"
اهم نصيحتين في المجال لازم تبقي حافظهم "مهمين جدا ** 10":🧠
1.  انك لازم تخلي الحل روتين مش بالشغل يعني لازم كل يوم تحل حتي لو مسئله واحده div 4 A المهم انك متوقفش و الايام الي تبقي فايق فيها تعلي بالمستوي لان التحدي لازم 😃
2. كل يوم ال PS هيجبلك شكوك في حياتك كلها حرفيا فانت لازم لازم لازم يبقي عندك growth mindset يعني لو حاجة وقفت قدامك انت مش فارق معاك انت قعدت فيها قد ايه ولا مفروض كنت تحلها في قد ايه ولا سهولتها كانت قد ايه انت مش شايف قدامك غير حاجة واحده بس "انا اتعلمت ايه من المسئلة دي" الموضوع ده مهم جدا لانها مشكلة بتقابلنا كلنا فلازم نتعامل معاها لان احنا لو فضلنا نقطم نفسنا بعد كل مسئلة منعرفهاش بدل ما نتعلم منها هنفقد الشغف بسرعة وهنبطل علطول فلازم نمشي بالعقلية دي 🧡
من غير النصيحتين دول فاضمنلك انك مش هتكمل في المجال فخد بالك بقي يباشا منهم وحطهم حلقتين في ودنك 😉💖


*/